Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <module id="00000" name="CORE" version="">
            <instance name="CORE">
               <register-group address-space="" name="CORE" name-in-module="CORE" offset="0x0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02823" name="CRU" version="">
            <instance name="CRU">
               <register-group address-space="periph_pb1_std" name="CRU" name-in-module="CRU" offset="0x1f801200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01461" name="CTMU" version="">
            <instance name="CTMU">
               <register-group address-space="periph_pb2_std" name="CTMU" name-in-module="CTMU" offset="0x1f82d000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01500" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph_pb1_fast" name="DMAC" name-in-module="DMAC" offset="0x1f811000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01520" name="DMT" version="">
            <instance name="DMT">
               <register-group address-space="periph_pb1_std" name="DMT" name-in-module="DMT" offset="0x1f800e00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02467" name="GPIO" version="">
            <instance name="GPIO">
               <register-group address-space="periph_pb4_std" name="GPIO" name-in-module="GPIO" offset="0x1f860000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02511" name="HLVD" version="">
            <instance name="HLVD">
               <register-group address-space="periph_pb1_std" name="HLVD" name-in-module="HLVD" offset="0x1f801800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01441" name="I2C" version="">
            <instance name="I2C1">
               <register-group address-space="periph_pb2_std" name="I2C" name-in-module="I2C" offset="0x1f826000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00740" name="ICAP" version="">
            <instance name="ICAP1">
               <register-group address-space="periph_pb2_std" name="ICAP" name-in-module="ICAP" offset="0x1f822000" />
               <parameters>
                  <param caption="Timer 3" name="TMR_SRC_0" value="0" />
                  <param caption="Timer 2" name="TMR_SRC_1" value="1" />
                  <param caption="Timer 5" name="TMR_ALTERNATE_SRC_0" value="0" />
                  <param caption="Timer 4" name="TMR_ALTERNATE_SRC_1" value="1" />
               </parameters>
            </instance>
            <instance name="ICAP2">
               <parameters>
                  <param caption="Timer 3" name="TMR_SRC_0" value="0" />
                  <param caption="Timer 2" name="TMR_SRC_1" value="1" />
                  <param caption="Timer 5" name="TMR_ALTERNATE_SRC_0" value="0" />
                  <param caption="Timer 4" name="TMR_ALTERNATE_SRC_1" value="1" />
               </parameters>
            </instance>
            <instance name="ICAP3">
               <parameters>
                  <param caption="Timer 3" name="TMR_SRC_0" value="0" />
                  <param caption="Timer 2" name="TMR_SRC_1" value="1" />
                  <param caption="Timer 5" name="TMR_ALTERNATE_SRC_0" value="0" />
                  <param caption="Timer 4" name="TMR_ALTERNATE_SRC_1" value="1" />
               </parameters>
            </instance>
            <instance name="ICAP4">
               <parameters>
                  <param caption="Timer 3" name="TMR_SRC_0" value="0" />
                  <param caption="Timer 2" name="TMR_SRC_1" value="1" />
                  <param caption="Timer 3" name="TMR_ALTERNATE_SRC_0" value="0" />
                  <param caption="Timer 2" name="TMR_ALTERNATE_SRC_1" value="1" />
               </parameters>
            </instance>
         </module>
         <module id="02907" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph_pb1_fast" name="INT" name-in-module="INT" offset="0x1f810000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02869" name="JTAG" version="">
            <instance name="JTAG">
               <register-group address-space="periph_pb1_std" name="JTAG" name-in-module="JTAG" offset="0x1f801000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01477" name="MCPWM" version="">
            <instance name="MCPWM">
               <register-group address-space="periph_pb2_std" name="MCPWM" name-in-module="MCPWM" offset="0x1f82a000" />
               <parameters>
                  <param name="MCPWM_CH1_OUTPUTS" value="2" />
                  <param name="MCPWM_CH2_OUTPUTS" value="2" />
                  <param name="MCPWM_CH3_OUTPUTS" value="2" />
                  <param name="MCPWM_CH4_OUTPUTS" value="2" />
               </parameters>
            </instance>
         </module>
         <module id="02819" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph_pb1_std" name="NVM" name-in-module="NVM" offset="0x1f800a00" />
               <parameters>
                  <param name="PAGE_SIZE" value="4096" />
                  <param name="ROW_SIZE" value="512" />
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
               <register-group address-space="periph_pb2_std" name="OCMP" name-in-module="OCMP" offset="0x1f824000" />
               <parameters>
                  <param caption="Timer 2" name="TMR_SRC_0" value="0" />
                  <param caption="Timer 3" name="TMR_SRC_1" value="1" />
                  <param caption="Timer 4" name="TMR_ALTERNATE_SRC_0" value="0" />
                  <param caption="Timer 5" name="TMR_ALTERNATE_SRC_1" value="1" />
               </parameters>
            </instance>
            <instance name="OCMP2">
               <parameters>
                  <param caption="Timer 2" name="TMR_SRC_0" value="0" />
                  <param caption="Timer 3" name="TMR_SRC_1" value="1" />
                  <param caption="Timer 4" name="TMR_ALTERNATE_SRC_0" value="0" />
                  <param caption="Timer 5" name="TMR_ALTERNATE_SRC_1" value="1" />
               </parameters>
            </instance>
