Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC0TIME" offset="0x350" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC0TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC0TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC0TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC0TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC0TIME__ADCEIS" />
         </register>
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC1TIME" offset="0x360" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC1TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC1TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC1TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC1TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC1TIME__ADCEIS" />
         </register>
         <register caption="ADC Early Interrupt Enable Register 1" name="ADCEIEN1" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000001" name="EIEN0" values="ADCEIEN1__EIEN0" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000002" name="EIEN1" values="ADCEIEN1__EIEN1" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000004" name="EIEN2" values="ADCEIEN1__EIEN2" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000008" name="EIEN3" values="ADCEIEN1__EIEN3" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000010" name="EIEN4" values="ADCEIEN1__EIEN4" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000020" name="EIEN5" values="ADCEIEN1__EIEN5" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00002000" name="EIEN13" values="ADCEIEN1__EIEN13" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00008000" name="EIEN15" values="ADCEIEN1__EIEN15" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00010000" name="EIEN16" values="ADCEIEN1__EIEN16" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00020000" name="EIEN17" values="ADCEIEN1__EIEN17" />
         </register>
         <register caption="" name="ADCEIEN2" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00040000" name="EIEN50" values="ADCEIEN2__EIEN50" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00200000" name="EIEN53" values="ADCEIEN2__EIEN53" />
         </register>
         <register caption="ADC Early Interrupt Status Register 1" name="ADCEISTAT1" offset="0x3e0" rw="R" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000001" name="EIRDY0" values="ADCEISTAT1__EIRDY0" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000002" name="EIRDY1" values="ADCEISTAT1__EIRDY1" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000004" name="EIRDY2" values="ADCEISTAT1__EIRDY2" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000008" name="EIRDY3" values="ADCEISTAT1__EIRDY3" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000010" name="EIRDY4" values="ADCEISTAT1__EIRDY4" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000020" name="EIRDY5" values="ADCEISTAT1__EIRDY5" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00002000" name="EIRDY13" values="ADCEISTAT1__EIRDY13" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00008000" name="EIRDY15" values="ADCEISTAT1__EIRDY15" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00010000" name="EIRDY16" values="ADCEISTAT1__EIRDY16" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00020000" name="EIRDY17" values="ADCEISTAT1__EIRDY17" />
         </register>
         <register caption="ADC Early Interrupt Status Register 2" name="ADCEISTAT2" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00040000" name="EIRDY50" values="ADCEISTAT2__EIRDY50" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00200000" name="EIRDY53" values="ADCEISTAT2__EIRDY53" />
         </register>
         <register caption="ADC Analog Warm-up Control Register" name="ADCANCON" offset="0x400" rw="RW" size="4">
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000001" name="ANEN0" values="ADCANCON__ANEN0" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000002" name="ANEN1" values="ADCANCON__ANEN1" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000080" name="ANEN7" values="ADCANCON__ANEN7"/>
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000100" name="WKRDY0" values="ADCANCON__WKRDY0" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000200" name="WKRDY1" values="ADCANCON__WKRDY1" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00008000" name="WKRDY7" values="ADCANCON__WKRDY7" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00010000" name="WKIEN0" values="ADCANCON__WKIEN0" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00020000" name="WKIEN1" values="ADCANCON__WKIEN1" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00800000" name="WKIEN7" values="ADCANCON__WKIEN7" />
            <bitfield caption="Wake-up Clock Count bits" mask="0x0F000000" name="WKUPCLKCNT" values="ADCANCON__WKUPCLKCNT" />
         </register>
         <register caption="" name="ADCDATA0" offset="0x600" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA1" offset="0x610" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA2" offset="0x620" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA3" offset="0x630" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA4" offset="0x640" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
