Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="AN0 Signed Data Mode bit" name="ADCIMCON1__SIGN0">
         <value caption="AN0 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN0 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN0 Mode bit" name="ADCIMCON1__DIFF0">
         <value caption="Selects AN0 differential input pair as AN0+ and AN6-" name="" value="0x1" />
         <value caption="AN0 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN1 Signed Data Mode bit" name="ADCIMCON1__SIGN1">
         <value caption="AN1 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN1 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN1 Mode bit" name="ADCIMCON1__DIFF1">
         <value caption="Selects AN1 differential input pair as AN1+ and AN7-" name="" value="0x1" />
         <value caption="AN1 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN2 Signed Data Mode bit" name="ADCIMCON1__SIGN2">
         <value caption="AN2 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN2 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN2 Mode bit" name="ADCIMCON1__DIFF2">
         <value caption="Selects AN2 differential input pair as AN2+ and AN8-" name="" value="0x1" />
         <value caption="AN2 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN3 Signed Data Mode bit" name="ADCIMCON1__SIGN3">
         <value caption="AN3 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN3 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN3 Mode bit" name="ADCIMCON1__DIFF3">
         <value caption="Selects AN3 differential input pair as AN3+ and AN27-" name="" value="0x1" />
         <value caption="AN3 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN4 Signed Data Mode bit" name="ADCIMCON1__SIGN4">
         <value caption="AN4 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN4 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN4 Mode bit" name="ADCIMCON1__DIFF4">
         <value caption="Selects AN4 differential input pair as AN4+ and AN10-" name="" value="0x1" />
         <value caption="AN4 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN5 Signed Data Mode bit" name="ADCIMCON1__SIGN5">
         <value caption="AN5 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN5 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN5 Mode bit" name="ADCIMCON1__DIFF5">
         <value caption="Selects AN5 differential input pair as AN5+ and AN11-" name="" value="0x1" />
         <value caption="AN5 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN6 Signed Data Mode bit" name="ADCIMCON1__SIGN6">
         <value caption="AN6 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN6 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN6 Mode bit" name="ADCIMCON1__DIFF6">
         <value caption="Selects AN6 differential input pair as AN6+ and AN1-" name="" value="0x1" />
         <value caption="AN6 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN7 Signed Data Mode bit" name="ADCIMCON1__SIGN7">
         <value caption="AN7 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN7 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN7 Mode bit" name="ADCIMCON1__DIFF7">
         <value caption="Selects AN7 differential input pair as AN7+ and AN1-" name="" value="0x1" />
         <value caption="AN7 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN8 Signed Data Mode bit" name="ADCIMCON1__SIGN8">
         <value caption="AN8 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN8 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN 8 Mode bit" name="ADCIMCON1__DIFF8">
         <value caption="Selects AN8 differential input pair as AN8+ and AN1-" name="" value="0x1" />
         <value caption="AN8 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN9 Signed Data Mode bit" name="ADCIMCON1__SIGN9">
         <value caption="AN9 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN9 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN9 Mode bit" name="ADCIMCON1__DIFF9">
         <value caption="Selects AN9 differential input pair as AN9+ and AN1-" name="" value="0x1" />
         <value caption="AN9 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN10 Signed Data Mode bit" name="ADCIMCON1__SIGN10">
         <value caption="AN10 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN10 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN10 Mode bit" name="ADCIMCON1__DIFF10">
         <value caption="Selects AN10 differential input pair as AN10+ and AN1-" name="" value="0x1" />
         <value caption="AN10 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN11 Signed Data Mode bit" name="ADCIMCON1__SIGN11">
         <value caption="AN11 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN11 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN11 Mode bit" name="ADCIMCON1__DIFF11">
         <value caption="Selects AN11 differential input pair as AN11+ and AN1-" name="" value="0x1" />
         <value caption="AN11 is using Single-ended mode" name="" value="0x0" />
      </value-group>
