Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="AN12 Signed Data Mode bit" name="ADCIMCON1__SIGN12">
         <value caption="AN12 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN12 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN12 Mode bit" name="ADCIMCON1__DIFF12">
         <value caption="Selects AN12 differential input pair as AN12+ and AN1-" name="" value="0x1" />
         <value caption="AN12 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN13 Signed Data Mode bit" name="ADCIMCON1__SIGN13">
         <value caption="AN13 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN13 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN13 Mode bit" name="ADCIMCON1__DIFF13">
         <value caption="Selects AN13 differential input pair as AN13+ and AN1-" name="" value="0x1" />
         <value caption="AN13 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN14 Signed Data Mode bit" name="ADCIMCON1__SIGN14">
         <value caption="AN14 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN14 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN14 Mode bit" name="ADCIMCON1__DIFF14">
         <value caption="Selects AN14 differential input pair as AN14+ and AN1-" name="" value="0x1" />
         <value caption="AN14 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="ADCIMCON1__SIGN15">
         <value caption="AN15 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN15 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN15 Mode bit" name="ADCIMCON1__DIFF15">
         <value caption="Selects AN15 differential input pair as AN15+ and AN1-" name="" value="0x1" />
         <value caption="AN15 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN16 Signed Data Mode bit" name="ADCIMCON2__SIGN16">
         <value caption="AN16 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN16 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN16 Mode bit" name="ADCIMCON2__DIFF16">
         <value caption="Selects AN16 differential pair input as AN16+ and AN1-" name="" value="0x1" />
         <value caption="AN16 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN17 Signed Data Mode bit" name="ADCIMCON2__SIGN17">
         <value caption="AN17 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN17 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN17 Mode bit" name="ADCIMCON2__DIFF17">
         <value caption="Selects AN17 differential pair input as AN17+ and AN1-" name="" value="0x1" />
         <value caption="AN17 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN0">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN1">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN2">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN3">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN4">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN5">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN6">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN7">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
