Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="Trigger Source for Conversion of Analog Input AN9 Select bits" name="ADCTRG3__TRGSRC9">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN10 Select bits" name="ADCTRG3__TRGSRC10">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN11 Select bits" name="ADCTRG3__TRGSRC11">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN12 Select bits" name="ADCTRG4__TRGSRC12">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
