Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="Trigger Source for Conversion of Analog Input AN13 Select bits" name="ADCTRG4__TRGSRC13">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN14 Select bits" name="ADCTRG4__TRGSRC14">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN15 Select bits" name="ADCTRG4__TRGSRC15">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN16 Select bits" name="ADCTRG5__TRGSRC16">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN17 Select bits" name="ADCTRG5__TRGSRC17">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary Special Event trigger" name="" value="0x9" />
         <value caption="Primary Special Event trigger" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator 0 Event bit" name="ADCCMPCON1__IELOLO">
         <value caption="Generate a Digital Comparator 0 Event when DATA less than DCMPLO" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator 0 Event bit" name="ADCCMPCON1__IELOHI">
         <value caption="Generate a Digital Comparator 0 Event when DCMPLO less than DATA" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low Digital Comparator 0 Event bit" name="ADCCMPCON1__IEHILO">
         <value caption="Generate a Digital Comparator 0 Event when DATA less than DCMPHI" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/High Digital Comparator 0 Event bit" name="ADCCMPCON1__IEHIHI">
         <value caption="Generate a Digital Comparator 0 Event when DCMPHI less than DATA" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Between Low/High Digital Comparator 1 Event bit" name="ADCCMPCON1__IEBTWN">
         <value caption="Generate a digital comparator event when DCMPLO less than DATA less than DCMPHI" name="" value="0x1" />
         <value caption="Do not generate a digital comparator event" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 Output True Event Status bit" name="ADCCMPCON1__DCMPED">
         <value caption="Digital Comparator 1 output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator 1 output is false (output of comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 Global Interrupt Enable bit" name="ADCCMPCON1__DCMPGIEN">
         <value caption="A Digital Comparator 1 interrupt is generated when the DCMPED status bit (ADCCMP0CON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator 1 interrupt is disabled " name="" value="0x0" />
      </value-group>
