Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="Digital Comparator 1 Enable bit" name="ADCCMPCON1__ENDCMP">
         <value caption="Digital Comparator 1 is enabled" name="" value="0x1" />
         <value caption="Digital Comparator 1 is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 1 Analog Input Identification bits" name="ADCCMPCON1__AINID">
         <value caption="Reserved" name="" value="0x3f" />
         <value caption="Reserved" name="" value="0x3e" />
         <value caption="Reserved" name="" value="0x3d" />
         <value caption="Reserved" name="" value="0x3c" />
         <value caption="Reserved" name="" value="0x3b" />
         <value caption="Reserved" name="" value="0x3a" />
         <value caption="Reserved" name="" value="0x39" />
         <value caption="Reserved" name="" value="0x38" />
         <value caption="Reserved" name="" value="0x37" />
         <value caption="Reserved" name="" value="0x36" />
         <value caption="Internal AN53 (CTMU temperature sensor)" name="" value="0x35" />
         <value caption="Internal AN50 (IVref 1.2V)" name="" value="0x32" />
         <value caption="Reserved" name="" value="0x31" />
         <value caption="Reserved" name="" value="0x30" />
         <value caption="Reserved" name="" value="0x2f" />
         <value caption="Reserved" name="" value="0x2e" />
         <value caption="Reserved" name="" value="0x2d" />
         <value caption="Reserved" name="" value="0x2c" />
         <value caption="Reserved" name="" value="0x2b" />
         <value caption="Reserved" name="" value="0x2a" />
         <value caption="Reserved" name="" value="0x29" />
         <value caption="Reserved" name="" value="0x28" />
         <value caption="Reserved" name="" value="0x27" />
         <value caption="Reserved" name="" value="0x26" />
         <value caption="Reserved" name="" value="0x25" />
         <value caption="Reserved" name="" value="0x24" />
         <value caption="Reserved" name="" value="0x23" />
         <value caption="Reserved" name="" value="0x22" />
         <value caption="Reserved" name="" value="0x21" />
         <value caption="Reserved" name="" value="0x3c" />
         <value caption="Reserved" name="" value="0x3b" />
         <value caption="Reserved" name="" value="0x3a" />
         <value caption="Reserved" name="" value="0x39" />
         <value caption="Reserved" name="" value="0x38" />
         <value caption="Reserved" name="" value="0x1b" />
         <value caption="Reserved" name="" value="0x1a" />
         <value caption="Reserved" name="" value="0x19" />
         <value caption="Reserved" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="Reserved" name="" value="0x14" />
         <value caption="Reserved" name="" value="0x13" />
         <value caption="Reserved" name="" value="0x12" />
         <value caption="AN17 is being monitored" name="" value="0x11" />
         <value caption="AN16 is being monitored" name="" value="0x10" />
         <value caption="AN15 is being monitored" name="" value="0xf" />
         <value caption="AN14 is being monitored" name="" value="0xe" />
         <value caption="AN13 is being monitored" name="" value="0xd" />
         <value caption="AN12 is being monitored" name="" value="0xc" />
         <value caption="AN11 is being monitored" name="" value="0xb" />
         <value caption="AN10 is being monitored" name="" value="0xa" />
         <value caption="AN9 is being monitored" name="" value="0x9" />
         <value caption="AN8 is being monitored" name="" value="0x8" />
         <value caption="AN7 is being monitored" name="" value="0x7" />
         <value caption="AN6 is being monitored" name="" value="0x6" />
         <value caption="AN5 is being monitored" name="" value="0x5" />
         <value caption="AN4 is being monitored" name="" value="0x4" />
         <value caption="AN3 is being monitored" name="" value="0x3" />
         <value caption="AN2 is being monitored" name="" value="0x2" />
         <value caption="AN1 is being monitored" name="" value="0x1" />
         <value caption="AN0 is being monitored" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON2__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits less than DCMPLO(15:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON2__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO bits less than DATA(31:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON2__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits less than DCMPHI(15:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON2__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI bits less than or equal to DATA(31:0) bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Between Low/High Digital Comparator x Event bit" name="ADCCMPCON2__IEBTWN">
         <value caption="Generate a digital comparator event when the DCMPLO bits less than DATA bits less than DCMPHI bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
