Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="Digital Comparator 'x' Output True Event Status bit" name="ADCCMPCON2__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Global Interrupt Enable bit" name="ADCCMPCON2__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Enable bit" name="ADCCMPCON2__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1" />
         <value caption="Digital Comparator x is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Analog Input Identification bits" name="ADCCMPCON2__AINID">
         <value caption="AN17" name="" value="0x11" />
         <value caption="AN16" name="" value="0x10" />
         <value caption="AN15" name="" value="0xf" />
         <value caption="AN14" name="" value="0xe" />
         <value caption="AN13" name="" value="0xd" />
         <value caption="AN12" name="" value="0xc" />
         <value caption="AN11" name="" value="0xb" />
         <value caption="AN10" name="" value="0xa" />
         <value caption="AN9" name="" value="0x9" />
         <value caption="AN8" name="" value="0x8" />
         <value caption="AN7" name="" value="0x7" />
         <value caption="AN6" name="" value="0x6" />
         <value caption="AN5" name="" value="0x5" />
         <value caption="AN4" name="" value="0x4" />
         <value caption="AN3" name="" value="0x3" />
         <value caption="AN2" name="" value="0x2" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC0" name="ADCDSTAT__RAF0">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC1" name="ADCDSTAT__RAF1">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC0" name="ADCDSTAT__RAFIEN0">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC1" name="ADCDSTAT__RAFIEN1">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC0" name="ADCDSTAT__RBF0">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC1" name="ADCDSTAT__RBF1">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC0" name="ADCDSTAT__RBFIEN0">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC1" name="ADCDSTAT__RBFIEN1">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="Global ADC DMA Enable bit" name="ADCDSTAT__DMAEN">
         <value caption="DMA interface is enabled" name="" value="0x1" />
         <value caption="DMA interface is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL0">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL1">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL2">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
