Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="CLCx Negative Edge Interrupt Enable bit" name="CLC1CON__INTN">
         <value caption="Interrupt will be generated when a falling edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Positive Edge Interrupt Enable bit" name="CLC1CON__INTP">
         <value caption="Interrupt will be generated when a rising edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Enable bit" name="CLC1CON__ON">
         <value caption="CLCx is enabled and mixing input signals" name="" value="0x1" />
         <value caption="CLCx is disabled and has logic zero outputs" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Polarity Control bit" name="CLC1CON__G1POL">
         <value caption="The output of Channel 1 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 1 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Polarity Control bit" name="CLC1CON__G2POL">
         <value caption="The output of Channel 2 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 2 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Polarity Control bit" name="CLC1CON__G3POL">
         <value caption="The output of Channel 3 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 3 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Polarity Control bit" name="CLC1CON__G4POL">
         <value caption="The output of Channel 4 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 4 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC1SEL__DS1">
         <value caption="TMR2 compare match event" name="" value="0x7" />
         <value caption="OCMP1 event" name="" value="0x6" />
         <value caption="ICAP1 event" name="" value="0x5" />
         <value caption="REFO2 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC1SEL__DS2">
         <value caption="TMR3 compare match event" name="" value="0x7" />
         <value caption="OCMP2 event" name="" value="0x6" />
         <value caption="ICAP2 event" name="" value="0x5" />
         <value caption="ADC7 End of Conversion" name="" value="0x4" />
         <value caption="UART1 TX Out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC1SEL__DS3">
         <value caption="TMR4 Compare match event" name="" value="0x7" />
         <value caption="OCMP3 event" name="" value="0x6" />
         <value caption="ICAP3 event" name="" value="0x5" />
         <value caption="UART1 RX In" name="" value="0x4" />
         <value caption="SPI SDO Out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC1 Out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC1SEL__DS4">
         <value caption="UART1 BCLK/RTS" name="" value="0x7" />
         <value caption="OCMP4 event" name="" value="0x6" />
         <value caption="ICAP4 event" name="" value="0x5" />
         <value caption="RTCC event" name="" value="0x4" />
         <value caption="SPI1 SDI1 in" name="" value="0x3" />
         <value caption="TMR2 Sync Out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 1 Negated Enable bit" name="CLC1GLS__G1D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 1 True Enable bit" name="CLC1GLS__G1D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 2 Negated Enable bit" name="CLC1GLS__G1D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 2 True Enable bit" name="CLC1GLS__G1D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 3 Negated Enable bit" name="CLC1GLS__G1D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 3 True Enable bit" name="CLC1GLS__G1D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 Negated Enable bit" name="CLC1GLS__G1D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 True Enable bit" name="CLC1GLS__G1D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
