Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="Bad STEP1/2 Value Detect bits" name="DMTSTAT__BAD">
         <value caption="Incorrect STEP1 value was detected/Incorrect STEP2 value was detected" name="" value="0x3" />
         <value caption="Incorrect STEP1 value was detected/Incorrect STEP2 value was not detected" name="" value="0x2" />
         <value caption="Incorrect STEP1 value was not detected/Incorrect STEP2 value was detected" name="" value="0x1" />
         <value caption="Incorrect STEP1 value was not detected/Incorrect STEP2 value was not detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Bad STEP1 Value Detect bit" name="DMTSTAT__BAD1">
         <value caption="Incorrect STEP1 value was detected" name="" value="0x1" />
         <value caption="Incorrect STEP1 value was not detected" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02467" name="GPIO" version="1">
      <register-group name="GPIO">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSELA" />
            <bitfield caption="" mask="0x00000002" name="ANSELA" />
            <bitfield caption="" mask="0x00000010" name="ANSELA" />
            <bitfield caption="" mask="0x00000080" name="ANSELA" />
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSELB" />
            <bitfield caption="" mask="0x00000002" name="ANSELB" />
            <bitfield caption="" mask="0x00000004" name="ANSELB" />
            <bitfield caption="" mask="0x00000008" name="ANSELB" />
            <bitfield caption="" mask="0x00000080" name="ANSELB" />
            <bitfield caption="" mask="0x00000200" name="ANSELB" />
         </register>
         <register caption="" name="ANSELC" offset="0x200" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="ANSELC" />
            <bitfield caption="" mask="0x00008000" name="ANSELC" />
         </register>
         <register caption="" name="ANSELD" offset="0x300" rw="RW" size="4" />
         <register caption="" name="TRISA" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISA" />
            <bitfield caption="" mask="0x00000002" name="TRISA" />
            <bitfield caption="" mask="0x00000010" name="TRISA" />
            <bitfield caption="" mask="0x00000400" name="TRISA" />
         </register>
         <register caption="" name="TRISB" offset="0x110" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISB" />
            <bitfield caption="" mask="0x00000002" name="TRISB" />
            <bitfield caption="" mask="0x00000004" name="TRISB" />
            <bitfield caption="" mask="0x00000008" name="TRISB" />
            <bitfield caption="" mask="0x00000010" name="TRISB" />
            <bitfield caption="" mask="0x00000020" name="TRISB" />
            <bitfield caption="" mask="0x00000040" name="TRISB" />
            <bitfield caption="" mask="0x00000080" name="TRISB" />
            <bitfield caption="" mask="0x00000200" name="TRISB" />
            <bitfield caption="" mask="0x00000400" name="TRISB" />
            <bitfield caption="" mask="0x00000800" name="TRISB" />
            <bitfield caption="" mask="0x00001000" name="TRISB" />
            <bitfield caption="" mask="0x00002000" name="TRISB" />
            <bitfield caption="" mask="0x00004000" name="TRISB" />
            <bitfield caption="" mask="0x00008000" name="TRISB" />
         </register>
         <register caption="" name="TRISC" offset="0x210" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="TRISC" />
            <bitfield caption="" mask="0x00008000" name="TRISC" />
         </register>
         <register caption="" name="TRISD" offset="0x310" rw="RW" size="4" />
         <register caption="" name="PORTA" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="PORTA" />
            <bitfield caption="" mask="0x00000002" name="PORTA" />
            <bitfield caption="" mask="0x00000010" name="PORTA" />
            <bitfield caption="" mask="0x00000400" name="PORTA" />
         </register>
         <register caption="" name="PORTB" offset="0x120" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="PORTB" />
            <bitfield caption="" mask="0x00000002" name="PORTB" />
            <bitfield caption="" mask="0x00000004" name="PORTB" />
            <bitfield caption="" mask="0x00000008" name="PORTB" />
            <bitfield caption="" mask="0x00000010" name="PORTB" />
            <bitfield caption="" mask="0x00000020" name="PORTB" />
            <bitfield caption="" mask="0x00000040" name="PORTB" />
            <bitfield caption="" mask="0x00000080" name="PORTB" />
            <bitfield caption="" mask="0x00000200" name="PORTB" />
            <bitfield caption="" mask="0x00000400" name="PORTB" />
            <bitfield caption="" mask="0x00000800" name="PORTB" />
            <bitfield caption="" mask="0x00001000" name="PORTB" />
            <bitfield caption="" mask="0x00002000" name="PORTB" />
            <bitfield caption="" mask="0x00004000" name="PORTB" />
            <bitfield caption="" mask="0x00008000" name="PORTB" />
         </register>
         <register caption="" name="PORTC" offset="0x220" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="PORTC" />
            <bitfield caption="" mask="0x00008000" name="PORTC" />
         </register>
         <register caption="" name="PORTD" offset="0x320" rw="RW" size="4" />
         <register caption="" name="LATA" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATA" />
            <bitfield caption="" mask="0x00000002" name="LATA" />
            <bitfield caption="" mask="0x00000010" name="LATA" />
            <bitfield caption="" mask="0x00000400" name="LATA" />
         </register>
         <register caption="" name="LATB" offset="0x130" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATB" />
            <bitfield caption="" mask="0x00000002" name="LATB" />
            <bitfield caption="" mask="0x00000004" name="LATB" />
            <bitfield caption="" mask="0x00000008" name="LATB" />
            <bitfield caption="" mask="0x00000010" name="LATB" />
            <bitfield caption="" mask="0x00000020" name="LATB" />
            <bitfield caption="" mask="0x00000040" name="LATB" />
            <bitfield caption="" mask="0x00000080" name="LATB" />
            <bitfield caption="" mask="0x00000200" name="LATB" />
            <bitfield caption="" mask="0x00000400" name="LATB" />
            <bitfield caption="" mask="0x00000800" name="LATB" />
            <bitfield caption="" mask="0x00001000" name="LATB" />
            <bitfield caption="" mask="0x00002000" name="LATB" />
            <bitfield caption="" mask="0x00004000" name="LATB" />
            <bitfield caption="" mask="0x00008000" name="LATB" />
         </register>
         <register caption="" name="LATC" offset="0x230" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="LATC" />
            <bitfield caption="" mask="0x00008000" name="LATC" />
         </register>
         <register caption="" name="LATD" offset="0x330" rw="RW" size="4" />
