Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <register caption="" name="ODCA" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCA" />
            <bitfield caption="" mask="0x00000002" name="ODCA" />
            <bitfield caption="" mask="0x00000010" name="ODCA" />
            <bitfield caption="" mask="0x00000400" name="ODCA" />
         </register>
         <register caption="" name="ODCB" offset="0x140" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCB" />
            <bitfield caption="" mask="0x00000002" name="ODCB" />
            <bitfield caption="" mask="0x00000004" name="ODCB" />
            <bitfield caption="" mask="0x00000008" name="ODCB" />
            <bitfield caption="" mask="0x00000010" name="ODCB" />
            <bitfield caption="" mask="0x00000020" name="ODCB" />
            <bitfield caption="" mask="0x00000040" name="ODCB" />
            <bitfield caption="" mask="0x00000080" name="ODCB" />
            <bitfield caption="" mask="0x00000200" name="ODCB" />
            <bitfield caption="" mask="0x00000400" name="ODCB" />
            <bitfield caption="" mask="0x00000800" name="ODCB" />
            <bitfield caption="" mask="0x00001000" name="ODCB" />
            <bitfield caption="" mask="0x00002000" name="ODCB" />
            <bitfield caption="" mask="0x00004000" name="ODCB" />
            <bitfield caption="" mask="0x00008000" name="ODCB" />
         </register>
         <register caption="" name="ODCC" offset="0x240" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="ODCC" />
            <bitfield caption="" mask="0x00008000" name="ODCC" />
         </register>
         <register caption="" name="ODCD" offset="0x340" rw="RW" size="4" />
         <register caption="" name="CNPUA" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUA" />
            <bitfield caption="" mask="0x00000002" name="CNPUA" />
            <bitfield caption="" mask="0x00000010" name="CNPUA" />
            <bitfield caption="" mask="0x00000400" name="CNPUA" />
         </register>
         <register caption="" name="CNPUB" offset="0x150" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUB" />
            <bitfield caption="" mask="0x00000002" name="CNPUB" />
            <bitfield caption="" mask="0x00000004" name="CNPUB" />
            <bitfield caption="" mask="0x00000008" name="CNPUB" />
            <bitfield caption="" mask="0x00000010" name="CNPUB" />
            <bitfield caption="" mask="0x00000020" name="CNPUB" />
            <bitfield caption="" mask="0x00000040" name="CNPUB" />
            <bitfield caption="" mask="0x00000080" name="CNPUB" />
            <bitfield caption="" mask="0x00000200" name="CNPUB" />
            <bitfield caption="" mask="0x00000400" name="CNPUB" />
            <bitfield caption="" mask="0x00000800" name="CNPUB" />
            <bitfield caption="" mask="0x00001000" name="CNPUB" />
            <bitfield caption="" mask="0x00002000" name="CNPUB" />
            <bitfield caption="" mask="0x00004000" name="CNPUB" />
            <bitfield caption="" mask="0x00008000" name="CNPUB" />
         </register>
         <register caption="" name="CNPUC" offset="0x250" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="CNPUC" />
            <bitfield caption="" mask="0x00008000" name="CNPUC" />
         </register>
         <register caption="" name="CNPDA" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDA" />
            <bitfield caption="" mask="0x00000002" name="CNPDA" />
            <bitfield caption="" mask="0x00000010" name="CNPDA" />
            <bitfield caption="" mask="0x00000400" name="CNPDA" />
         </register>
         <register caption="" name="CNPDB" offset="0x160" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDB" />
            <bitfield caption="" mask="0x00000002" name="CNPDB" />
            <bitfield caption="" mask="0x00000004" name="CNPDB" />
            <bitfield caption="" mask="0x00000008" name="CNPDB" />
            <bitfield caption="" mask="0x00000010" name="CNPDB" />
            <bitfield caption="" mask="0x00000020" name="CNPDB" />
            <bitfield caption="" mask="0x00000040" name="CNPDB" />
            <bitfield caption="" mask="0x00000080" name="CNPDB" />
            <bitfield caption="" mask="0x00000200" name="CNPDB" />
            <bitfield caption="" mask="0x00000400" name="CNPDB" />
            <bitfield caption="" mask="0x00000800" name="CNPDB" />
            <bitfield caption="" mask="0x00001000" name="CNPDB" />
            <bitfield caption="" mask="0x00002000" name="CNPDB" />
            <bitfield caption="" mask="0x00004000" name="CNPDB" />
            <bitfield caption="" mask="0x00008000" name="CNPDB" />
         </register>
         <register caption="" name="CNPDC" offset="0x260" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="CNPDC" />
            <bitfield caption="" mask="0x00008000" name="CNPDC" />
         </register>
         <register caption="" name="CNPDD" offset="0x360" rw="RW" size="4" />
         <register caption="Change Notice control for PORTx Register" name="CNCONA" offset="0x70" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONA__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONA__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONB" offset="0x170" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONB__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONB__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONC" offset="0x270" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONC__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONC__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCOND" offset="0x370" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCOND__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCOND__ON" />
         </register>
