Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <register caption="" name="CNENA" offset="0x80" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNENA" />
            <bitfield caption="" mask="0x00000002" name="CNENA" />
            <bitfield caption="" mask="0x00000010" name="CNENA" />
            <bitfield caption="" mask="0x00000400" name="CNENA" />
         </register>
         <register caption="" name="CNENB" offset="0x180" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNENB" />
            <bitfield caption="" mask="0x00000002" name="CNENB" />
            <bitfield caption="" mask="0x00000004" name="CNENB" />
            <bitfield caption="" mask="0x00000008" name="CNENB" />
            <bitfield caption="" mask="0x00000010" name="CNENB" />
            <bitfield caption="" mask="0x00000020" name="CNENB" />
            <bitfield caption="" mask="0x00000040" name="CNENB" />
            <bitfield caption="" mask="0x00000080" name="CNENB" />
            <bitfield caption="" mask="0x00000200" name="CNENB" />
            <bitfield caption="" mask="0x00000400" name="CNENB" />
            <bitfield caption="" mask="0x00000800" name="CNENB" />
            <bitfield caption="" mask="0x00001000" name="CNENB" />
            <bitfield caption="" mask="0x00002000" name="CNENB" />
            <bitfield caption="" mask="0x00004000" name="CNENB" />
            <bitfield caption="" mask="0x00008000" name="CNENB" />
         </register>
         <register caption="" name="CNENC" offset="0x280" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="CNENC" />
            <bitfield caption="" mask="0x00008000" name="CNENC" />
         </register>
         <register caption="" name="CNEND" offset="0x380" rw="RW" size="4" />
         <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATA" />
            <bitfield caption="" mask="0x00000002" name="CNSTATA" />
            <bitfield caption="" mask="0x00000010" name="CNSTATA" />
            <bitfield caption="" mask="0x00000400" name="CNSTATA" />
         </register>
         <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATB" />
            <bitfield caption="" mask="0x00000002" name="CNSTATB" />
            <bitfield caption="" mask="0x00000004" name="CNSTATB" />
            <bitfield caption="" mask="0x00000008" name="CNSTATB" />
            <bitfield caption="" mask="0x00000010" name="CNSTATB" />
            <bitfield caption="" mask="0x00000020" name="CNSTATB" />
            <bitfield caption="" mask="0x00000040" name="CNSTATB" />
            <bitfield caption="" mask="0x00000080" name="CNSTATB" />
            <bitfield caption="" mask="0x00000200" name="CNSTATB" />
            <bitfield caption="" mask="0x00000400" name="CNSTATB" />
            <bitfield caption="" mask="0x00000800" name="CNSTATB" />
            <bitfield caption="" mask="0x00001000" name="CNSTATB" />
            <bitfield caption="" mask="0x00002000" name="CNSTATB" />
            <bitfield caption="" mask="0x00004000" name="CNSTATB" />
            <bitfield caption="" mask="0x00008000" name="CNSTATB" />
         </register>
         <register caption="" name="CNSTATC" offset="0x290" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="CNSTATC" />
            <bitfield caption="" mask="0x00008000" name="CNSTATC" />
         </register>
         <register caption="" name="CNSTATD" offset="0x390" rw="RW" size="4" />
         <register caption="" name="CNNEA" offset="0xa0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNNEA" />
            <bitfield caption="" mask="0x00000002" name="CNNEA" />
            <bitfield caption="" mask="0x00000010" name="CNNEA" />
            <bitfield caption="" mask="0x00000400" name="CNNEA" />
         </register>
         <register caption="" name="CNNEB" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNNEB" />
            <bitfield caption="" mask="0x00000002" name="CNNEB" />
            <bitfield caption="" mask="0x00000004" name="CNNEB" />
            <bitfield caption="" mask="0x00000008" name="CNNEB" />
            <bitfield caption="" mask="0x00000010" name="CNNEB" />
            <bitfield caption="" mask="0x00000020" name="CNNEB" />
            <bitfield caption="" mask="0x00000040" name="CNNEB" />
            <bitfield caption="" mask="0x00000080" name="CNNEB" />
            <bitfield caption="" mask="0x00000200" name="CNNEB" />
            <bitfield caption="" mask="0x00000400" name="CNNEB" />
            <bitfield caption="" mask="0x00000800" name="CNNEB" />
            <bitfield caption="" mask="0x00001000" name="CNNEB" />
            <bitfield caption="" mask="0x00002000" name="CNNEB" />
            <bitfield caption="" mask="0x00004000" name="CNNEB" />
            <bitfield caption="" mask="0x00008000" name="CNNEB" />
         </register>
         <register caption="" name="CNNEC" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="CNNEC" />
            <bitfield caption="" mask="0x00008000" name="CNNEC" />
         </register>
         <register caption="" name="CNNED" offset="0x3a0" rw="RW" size="4" />
         <register caption="" name="CNFA" offset="0xb0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFA" />
            <bitfield caption="" mask="0x00000002" name="CNFA" />
            <bitfield caption="" mask="0x00000010" name="CNFA" />
            <bitfield caption="" mask="0x00000400" name="CNFA" />
         </register>
         <register caption="" name="CNFB" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFB" />
            <bitfield caption="" mask="0x00000002" name="CNFB" />
            <bitfield caption="" mask="0x00000004" name="CNFB" />
            <bitfield caption="" mask="0x00000008" name="CNFB" />
            <bitfield caption="" mask="0x00000010" name="CNFB" />
            <bitfield caption="" mask="0x00000020" name="CNFB" />
            <bitfield caption="" mask="0x00000040" name="CNFB" />
            <bitfield caption="" mask="0x00000080" name="CNFB" />
            <bitfield caption="" mask="0x00000200" name="CNFB" />
            <bitfield caption="" mask="0x00000400" name="CNFB" />
            <bitfield caption="" mask="0x00000800" name="CNFB" />
            <bitfield caption="" mask="0x00001000" name="CNFB" />
            <bitfield caption="" mask="0x00002000" name="CNFB" />
            <bitfield caption="" mask="0x00004000" name="CNFB" />
            <bitfield caption="" mask="0x00008000" name="CNFB" />
         </register>
         <register caption="" name="CNFC" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00001000" name="CNFC" />
            <bitfield caption="" mask="0x00008000" name="CNFC" />
         </register>
         <register caption="" name="CNFD" offset="0x3b0" rw="RW" size="4" />
         <register caption="" name="SRCON0A" offset="0xc0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="SRCON0A" />
         </register>
         <register caption="" name="SRCON0B" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000010" name="SRCON0B" />
            <bitfield caption="" mask="0x00000040" name="SRCON0B" />
            <bitfield caption="" mask="0x00000080" name="SRCON0B" />
            <bitfield caption="" mask="0x00000400" name="SRCON0B" />
            <bitfield caption="" mask="0x00000800" name="SRCON0B" />
            <bitfield caption="" mask="0x00001000" name="SRCON0B" />
            <bitfield caption="" mask="0x00002000" name="SRCON0B" />
            <bitfield caption="" mask="0x00004000" name="SRCON0B" />
            <bitfield caption="" mask="0x00008000" name="SRCON0B" />
         </register>
         <register caption="" name="SRCON0C" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00008000" name="SRCON0C" />
         </register>
         <register caption="" name="SRCON0D" offset="0x3c0" rw="RW" size="4" />
         <register caption="" name="SRCON1A" offset="0xd0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="SRCON1A" />
         </register>
