Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="Input Capture Buffer Not Empty Status bit (read-only)" name="IC4CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit (read-only)" name="IC4CON__ICOV">
         <value caption="Input capture overflow has occurred" name="" value="0x1" />
         <value caption="No input capture overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC4CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3" />
         <value caption="Interrupt on every third capture event" name="" value="0x2" />
         <value caption="Interrupt on every second capture event" name="" value="0x1" />
         <value caption="Interrupt on every capture event" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Select bit" name="IC4CON__ICTMR">
         <value caption="Timer3 is the counter source for capture" name="" value="0x0" />
         <value caption="Timer2 is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC4CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC4CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC4CON__SIDL">
         <value caption="Halt in Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC4CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module, disable clocks, disable interrupt generation and allow SFR modifications" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02907" name="INT" version="3">
      <register-group name="INT">
         <register caption="Interrupt Control Register" name="INTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="External Interrupt 0 Edge" mask="0x00000001" name="INT0EP" values="INTCON__INT0EP" />
            <bitfield caption="External Interrupt 1 Edge" mask="0x00000002" name="INT1EP" values="INTCON__INT1EP" />
            <bitfield caption="External Interrupt 2 Edge" mask="0x00000004" name="INT2EP" values="INTCON__INT2EP" />
            <bitfield caption="External Interrupt 3 Edge" mask="0x00000008" name="INT3EP" values="INTCON__INT3EP" />
            <bitfield caption="External Interrupt 4 Edge" mask="0x00000010" name="INT4EP" values="INTCON__INT4EP" />
            <bitfield caption="Interrupt Proximity Timer Control bits" mask="0x00000700" name="TPC" values="INTCON__TPC" />
            <bitfield caption="Multi Vector Configuration bit" mask="0x00001000" name="MVEC" values="INTCON__MVEC" />
            <bitfield mask="0xFF000000" name="NMIKEY" />
         </register>
         <register caption="Priority Shadow Select Register" name="PRISS" offset="0x10" rw="RW" size="4">
            <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00000001" name="SS0" values="PRISS__SS0" />
            <bitfield caption="Interrupt with Priority Level 1 Shadow Set bits" mask="0x000000F0" name="PRI1SS" values="PRISS__PRI1SS" />
            <bitfield caption="Interrupt with Priority Level 2 Shadow Set bits" mask="0x00000F00" name="PRI2SS" values="PRISS__PRI2SS" />
            <bitfield caption="Interrupt with Priority Level 3 Shadow Set bits" mask="0x0000F000" name="PRI3SS" values="PRISS__PRI3SS" />
            <bitfield caption="Interrupt with Priority Level 4 Shadow Set bits" mask="0x000F0000" name="PRI4SS" values="PRISS__PRI4SS" />
            <bitfield caption="Interrupt with Priority Level 5 Shadow Set bits" mask="0x00F00000" name="PRI5SS" values="PRISS__PRI5SS" />
            <bitfield caption="Interrupt with Priority Level 6 Shadow Set bits" mask="0x0F000000" name="PRI6SS" values="PRISS__PRI6SS" />
            <bitfield caption="Interrupt with Priority Level 7 Shadow Set bits" mask="0xF0000000" name="PRI7SS" values="PRISS__PRI7SS" />
         </register>
         <register caption="" name="INTSTAT" offset="0x20" rw="R" size="4">
            <bitfield caption="" mask="0x000000FF" name="SIRQ" />
            <bitfield caption="" mask="0x00000700" name="SRIPL" />
         </register>
         <register caption="" name="IPTMR" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="IPTMR" />
         </register>
         <register caption="" name="IFS0" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CTIF" />
            <bitfield caption="" mask="0x00000002" name="CS0IF" />
            <bitfield caption="" mask="0x00000004" name="CS1IF" />
            <bitfield caption="" mask="0x00000008" name="INT0IF" />
            <bitfield caption="" mask="0x00000010" name="T1IF" />
            <bitfield caption="" mask="0x00000020" name="IC1EIF" />
            <bitfield caption="" mask="0x00000040" name="IC1IF" />
            <bitfield caption="" mask="0x00000080" name="OC1IF" />
            <bitfield caption="" mask="0x00000100" name="INT1IF" />
            <bitfield caption="" mask="0x00000200" name="T2IF" />
            <bitfield caption="" mask="0x00000400" name="IC2EIF" />
            <bitfield caption="" mask="0x00000800" name="IC2IF" />
            <bitfield caption="" mask="0x00001000" name="OC2IF" />
            <bitfield caption="" mask="0x00002000" name="INT2IF" />
            <bitfield caption="" mask="0x00004000" name="T3IF" />
            <bitfield caption="" mask="0x00008000" name="IC3EIF" />
            <bitfield caption="" mask="0x00010000" name="IC3IF" />
            <bitfield caption="" mask="0x00020000" name="OC3IF" />
            <bitfield caption="" mask="0x00040000" name="INT3IF" />
            <bitfield caption="" mask="0x00080000" name="T4IF" />
            <bitfield caption="" mask="0x00100000" name="IC4EIF" />
            <bitfield caption="" mask="0x00200000" name="IC4IF" />
            <bitfield caption="" mask="0x00400000" name="OC4IF" />
            <bitfield caption="" mask="0x00800000" name="INT4IF" />
            <bitfield caption="" mask="0x01000000" name="T5IF" />
            <bitfield caption="" mask="0x40000000" name="RTCCIF" />
            <bitfield caption="" mask="0x80000000" name="FCEIF" />
         </register>
         <register caption="" name="IFS1" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CMP1IF" />
            <bitfield caption="" mask="0x00000002" name="CMP2IF" />
            <bitfield caption="" mask="0x00000008" name="SPI1EIF" />
            <bitfield caption="" mask="0x00000010" name="SPI1RXIF" />
            <bitfield caption="" mask="0x00000020" name="SPI1TXIF" />
            <bitfield caption="" mask="0x00000040" name="U1EIF" />
            <bitfield caption="" mask="0x00000080" name="U1RXIF" />
            <bitfield caption="" mask="0x00000100" name="U1TXIF" />
            <bitfield caption="" mask="0x00000200" name="I2C1BIF" />
            <bitfield caption="" mask="0x00000400" name="I2C1SIF" />
            <bitfield caption="" mask="0x00000800" name="I2C1MIF" />
            <bitfield caption="" mask="0x00001000" name="CNAIF" />
            <bitfield caption="" mask="0x00002000" name="CNBIF" />
            <bitfield caption="" mask="0x00004000" name="CNCIF" />
            <bitfield caption="" mask="0x00008000" name="CNDIF" />
            <bitfield caption="" mask="0x00200000" name="SPI2EIF" />
            <bitfield caption="" mask="0x00400000" name="SPI2RXIF" />
            <bitfield caption="" mask="0x00800000" name="SPI2TXIF" />
            <bitfield caption="" mask="0x01000000" name="U2EIF" />
            <bitfield caption="" mask="0x02000000" name="U2RXIF" />
            <bitfield caption="" mask="0x04000000" name="U2TXIF" />
            <bitfield caption="" mask="0x08000000" name="I2C2BIF" />
            <bitfield caption="" mask="0x10000000" name="I2C2SIF" />
            <bitfield caption="" mask="0x20000000" name="I2C2MIF" />
         </register>
         <register caption="" name="IFS2" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0x00000080" name="CTMUIF" />
            <bitfield caption="" mask="0x00000100" name="DMA0IF" />
            <bitfield caption="" mask="0x00000200" name="DMA1IF" />
            <bitfield caption="" mask="0x00000400" name="DMA2IF" />
            <bitfield caption="" mask="0x00000800" name="DMA3IF" />
            <bitfield caption="" mask="0x10000000" name="AD1IF" />
            <bitfield caption="" mask="0x40000000" name="AD1DC1IF" />
            <bitfield caption="" mask="0x80000000" name="AD1DC2IF" />
         </register>
         <register caption="" name="IFS3" offset="0x70" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="AD1DF1IF" />
            <bitfield caption="" mask="0x00000002" name="AD1DF2IF" />
            <bitfield caption="" mask="0x00000004" name="AD1DF3IF" />
            <bitfield caption="" mask="0x00000008" name="AD1DF4IF" />
            <bitfield caption="" mask="0x00000010" name="AD1FIIF" />
            <bitfield caption="" mask="0x00000020" name="AD1EOSIF" />
            <bitfield caption="" mask="0x00000040" name="AD1ARIF" />
            <bitfield caption="" mask="0x00000080" name="AD1RSIF" />
            <bitfield caption="" mask="0x00000100" name="AD1FCBTIF" />
            <bitfield caption="" mask="0x00000200" name="AD1GIF" />
            <bitfield caption="" mask="0x00000400" name="AD1D0IF" />
            <bitfield caption="" mask="0x00000800" name="AD1D1IF" />
            <bitfield caption="" mask="0x00001000" name="AD1D2IF" />
            <bitfield caption="" mask="0x00002000" name="AD1D3IF" />
            <bitfield caption="" mask="0x00004000" name="AD1D4IF" />
            <bitfield caption="" mask="0x00008000" name="AD1D5IF" />
            <bitfield caption="" mask="0x00800000" name="AD1D13IF" />
            <bitfield caption="" mask="0x02000000" name="AD1D15IF" />
            <bitfield caption="" mask="0x04000000" name="AD1D16IF" />
            <bitfield caption="" mask="0x08000000" name="AD1D17IF" />
         </register>
         <register caption="" name="IFS4" offset="0x80" rw="RW" size="4">
            <bitfield caption="" mask="0x10000000" name="AD1D50IF" />
            <bitfield caption="" mask="0x80000000" name="AD1D53IF" />
         </register>
         <register caption="" name="IFS5" offset="0x90" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="QEI1IF" />
            <bitfield caption="" mask="0x00000400" name="QEI2IF" />
            <bitfield caption="" mask="0x00000800" name="PWMPEVTIF" />
            <bitfield caption="" mask="0x00001000" name="PWMSEVTIF" />
            <bitfield caption="" mask="0x00002000" name="PWM1IF" />
            <bitfield caption="" mask="0x00004000" name="PWM2IF" />
            <bitfield caption="" mask="0x00008000" name="PWM3IF" />
            <bitfield caption="" mask="0x00010000" name="PWM4IF" />
            <bitfield caption="" mask="0x00400000" name="DMA4IF" />
            <bitfield caption="" mask="0x00800000" name="DMA5IF" />
            <bitfield caption="" mask="0x01000000" name="DMA6IF" />
            <bitfield caption="" mask="0x02000000" name="DMA7IF" />
         </register>
         <register caption="" name="IFS7" offset="0xb0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000040" name="SBIF" />
            <bitfield caption="PCACHE Interrupt Flag" mask="0x00800000" name="PCACHEIF" />
            <bitfield caption="" mask="0x02000000" name="CLC1IF" />
            <bitfield caption="" mask="0x40000000" name="CPCIF" />
            <bitfield caption="" mask="0x80000000" name="CPDIF" />
         </register>
         <register caption="" name="IEC0" offset="0xc0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CTIE" />
            <bitfield caption="" mask="0x00000002" name="CS0IE" />
            <bitfield caption="" mask="0x00000004" name="CS1IE" />
            <bitfield caption="" mask="0x00000008" name="INT0IE" />
            <bitfield caption="" mask="0x00000010" name="T1IE" />
            <bitfield caption="" mask="0x00000020" name="IC1EIE" />
            <bitfield caption="" mask="0x00000040" name="IC1IE" />
            <bitfield caption="" mask="0x00000080" name="OC1IE" />
            <bitfield caption="" mask="0x00000100" name="INT1IE" />
            <bitfield caption="" mask="0x00000200" name="T2IE" />
            <bitfield caption="" mask="0x00000400" name="IC2EIE" />
            <bitfield caption="" mask="0x00000800" name="IC2IE" />
            <bitfield caption="" mask="0x00001000" name="OC2IE" />
            <bitfield caption="" mask="0x00002000" name="INT2IE" />
            <bitfield caption="" mask="0x00004000" name="T3IE" />
            <bitfield caption="" mask="0x00008000" name="IC3EIE" />
            <bitfield caption="" mask="0x00010000" name="IC3IE" />
            <bitfield caption="" mask="0x00020000" name="OC3IE" />
            <bitfield caption="" mask="0x00040000" name="INT3IE" />
            <bitfield caption="" mask="0x00080000" name="T4IE" />
            <bitfield caption="" mask="0x00100000" name="IC4EIE" />
            <bitfield caption="" mask="0x00200000" name="IC4IE" />
            <bitfield caption="" mask="0x00400000" name="OC4IE" />
            <bitfield caption="" mask="0x00800000" name="INT4IE" />
            <bitfield caption="" mask="0x01000000" name="T5IE" />
            <bitfield caption="" mask="0x40000000" name="RTCCIE" />
            <bitfield caption="" mask="0x80000000" name="FCEIE" />
         </register>
         <register caption="" name="IEC1" offset="0xd0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CMP1IE" />
            <bitfield caption="" mask="0x00000002" name="CMP2IE" />
            <bitfield caption="" mask="0x00000008" name="SPI1EIE" />
            <bitfield caption="" mask="0x00000010" name="SPI1RXIE" />
            <bitfield caption="" mask="0x00000020" name="SPI1TXIE" />
            <bitfield caption="" mask="0x00000040" name="U1EIE" />
            <bitfield caption="" mask="0x00000080" name="U1RXIE" />
            <bitfield caption="" mask="0x00000100" name="U1TXIE" />
            <bitfield caption="" mask="0x00000200" name="I2C1BIE" />
            <bitfield caption="" mask="0x00000400" name="I2C1SIE" />
            <bitfield caption="" mask="0x00000800" name="I2C1MIE" />
            <bitfield caption="" mask="0x00001000" name="CNAIE" />
            <bitfield caption="" mask="0x00002000" name="CNBIE" />
            <bitfield caption="" mask="0x00004000" name="CNCIE" />
            <bitfield caption="" mask="0x00008000" name="CNDIE" />
            <bitfield caption="" mask="0x00200000" name="SPI2EIE" />
            <bitfield caption="" mask="0x00400000" name="SPI2RXIE" />
            <bitfield caption="" mask="0x00800000" name="SPI2TXIE" />
            <bitfield caption="" mask="0x01000000" name="U2EIE" />
            <bitfield caption="" mask="0x02000000" name="U2RXIE" />
            <bitfield caption="" mask="0x04000000" name="U2TXIE" />
            <bitfield caption="" mask="0x08000000" name="I2C2BIE" />
            <bitfield caption="" mask="0x10000000" name="I2C2SIE" />
            <bitfield caption="" mask="0x20000000" name="I2C2MIE" />
         </register>
         <register caption="" name="IEC2" offset="0xe0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000080" name="CTMUIE" />
            <bitfield caption="" mask="0x00000100" name="DMA0IE" />
            <bitfield caption="" mask="0x00000200" name="DMA1IE" />
            <bitfield caption="" mask="0x00000400" name="DMA2IE" />
            <bitfield caption="" mask="0x00000800" name="DMA3IE" />
            <bitfield caption="" mask="0x10000000" name="AD1IE" />
            <bitfield caption="" mask="0x40000000" name="AD1DC1IE" />
            <bitfield caption="" mask="0x80000000" name="AD1DC2IE" />
         </register>
