Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <register caption="" name="IEC3" offset="0xf0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="AD1DF1IE" />
            <bitfield caption="" mask="0x00000002" name="AD1DF2IE" />
            <bitfield caption="" mask="0x00000010" name="AD1FIIE" />
            <bitfield caption="" mask="0x00000020" name="AD1EOSIE" />
            <bitfield caption="" mask="0x00000040" name="AD1ARIE" />
            <bitfield caption="" mask="0x00000080" name="AD1RSIE" />
            <bitfield caption="" mask="0x00000100" name="AD1FCBTIE" />
            <bitfield caption="" mask="0x00000200" name="AD1GIE" />
            <bitfield caption="" mask="0x00000400" name="AD1D0IE" />
            <bitfield caption="" mask="0x00000800" name="AD1D1IE" />
            <bitfield caption="" mask="0x00001000" name="AD1D2IE" />
            <bitfield caption="" mask="0x00002000" name="AD1D3IE" />
            <bitfield caption="" mask="0x00004000" name="AD1D4IE" />
            <bitfield caption="" mask="0x00008000" name="AD1D5IE" />
            <bitfield caption="" mask="0x00800000" name="AD1D13IE" />
            <bitfield caption="" mask="0x02000000" name="AD1D15IE" />
            <bitfield caption="" mask="0x04000000" name="AD1D16IE" />
            <bitfield caption="" mask="0x08000000" name="AD1D17IE" />
         </register>
         <register caption="" name="IEC4" offset="0x100" rw="RW" size="4">
            <bitfield caption="" mask="0x10000000" name="AD1D50IE" />
            <bitfield caption="" mask="0x80000000" name="AD1D53IE" />
         </register>
         <register caption="" name="IEC5" offset="0x110" rw="RW" size="4">
            <bitfield caption="" mask="0x00000200" name="QEI1IE" />
            <bitfield caption="" mask="0x00000400" name="QEI2IE" />
            <bitfield caption="" mask="0x00000800" name="PWMPEVTIE" />
            <bitfield caption="" mask="0x00001000" name="PWMSEVTIE" />
            <bitfield caption="" mask="0x00002000" name="PWM1IE" />
            <bitfield caption="" mask="0x00004000" name="PWM2IE" />
            <bitfield caption="" mask="0x00008000" name="PWM3IE" />
            <bitfield caption="" mask="0x00010000" name="PWM4IE" />
            <bitfield caption="" mask="0x00400000" name="DMA4IE" />
            <bitfield caption="" mask="0x00800000" name="DMA5IE" />
            <bitfield caption="" mask="0x01000000" name="DMA6IE" />
            <bitfield caption="" mask="0x02000000" name="DMA7IE" />
         </register>
         <register caption="" name="IEC7" offset="0x130" rw="RW" size="4">
            <bitfield caption="" mask="0x00000040" name="SBIE" />
            <bitfield caption="PCACHE Interrupt Enable" mask="0x00800000" name="PCACHEIE" />
            <bitfield caption="" mask="0x02000000" name="CLC1IE" />
            <bitfield caption="" mask="0x40000000" name="CPCIE" />
            <bitfield caption="" mask="0x80000000" name="CFDCIE" />
         </register>
         <register caption="" name="IPC0" offset="0x140" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CTIS" />
            <bitfield caption="" mask="0x0000001C" name="CTIP" />
            <bitfield caption="" mask="0x00000300" name="CS0IS" />
            <bitfield caption="" mask="0x00001C00" name="CS0IP" />
            <bitfield caption="" mask="0x00030000" name="CS1IS" />
            <bitfield caption="" mask="0x001C0000" name="CS1IP" />
            <bitfield caption="" mask="0x03000000" name="INT0IS" />
            <bitfield caption="" mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="" name="IPC1" offset="0x150" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="T1IS" />
            <bitfield caption="" mask="0x0000001C" name="T1IP" />
            <bitfield caption="" mask="0x00000300" name="IC1EIS" />
            <bitfield caption="" mask="0x00001C00" name="IC1EIP" />
            <bitfield caption="" mask="0x00030000" name="IC1IS" />
            <bitfield caption="" mask="0x001C0000" name="IC1IP" />
            <bitfield caption="" mask="0x03000000" name="OC1IS" />
            <bitfield caption="" mask="0x1C000000" name="OC1IP" />
         </register>
         <register caption="" name="IPC2" offset="0x160" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="INT1IS" />
            <bitfield caption="" mask="0x0000001C" name="INT1IP" />
            <bitfield caption="" mask="0x00000300" name="T2IS" />
            <bitfield caption="" mask="0x00001C00" name="T2IP" />
            <bitfield caption="" mask="0x00030000" name="IC2EIS" />
            <bitfield caption="" mask="0x001C0000" name="IC2EIP" />
            <bitfield caption="" mask="0x03000000" name="IC2IS" />
            <bitfield caption="" mask="0x1C000000" name="IC2IP" />
         </register>
         <register caption="" name="IPC3" offset="0x170" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="OC2IS" />
            <bitfield caption="" mask="0x0000001C" name="OC2IP" />
            <bitfield caption="" mask="0x00000300" name="INT2IS" />
            <bitfield caption="" mask="0x00001C00" name="INT2IP" />
            <bitfield caption="" mask="0x00030000" name="T3IS" />
            <bitfield caption="" mask="0x001C0000" name="T3IP" />
            <bitfield caption="" mask="0x03000000" name="IC3EIS" />
            <bitfield caption="" mask="0x1C000000" name="IC3EIP" />
         </register>
         <register caption="" name="IPC4" offset="0x180" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="IC3IS" />
            <bitfield caption="" mask="0x0000001C" name="IC3IP" />
            <bitfield caption="" mask="0x00000300" name="OC3IS" />
            <bitfield caption="" mask="0x00001C00" name="OC3IP" />
            <bitfield caption="" mask="0x00030000" name="INT3IS" />
            <bitfield caption="" mask="0x001C0000" name="INT3IP" />
            <bitfield caption="" mask="0x03000000" name="T4IS" />
            <bitfield caption="" mask="0x1C000000" name="T4IP" />
         </register>
