Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <register caption="" name="IPC5" offset="0x190" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="IC4EIS" />
            <bitfield caption="" mask="0x0000001C" name="IC4EIP" />
            <bitfield caption="" mask="0x00000300" name="IC4IS" />
            <bitfield caption="" mask="0x00001C00" name="IC4IP" />
            <bitfield caption="" mask="0x00030000" name="OC4IS" />
            <bitfield caption="" mask="0x001C0000" name="OC4IP" />
            <bitfield caption="" mask="0x03000000" name="INT4IS" />
            <bitfield caption="" mask="0x1C000000" name="INT4IP" />
         </register>
         <register caption="" name="IPC6" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="T5IS" />
            <bitfield caption="" mask="0x0000001C" name="T5IP" />
         </register>
         <register caption="" name="IPC7" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00030000" name="RTCCIS" />
            <bitfield caption="" mask="0x001C0000" name="RTCCIP" />
            <bitfield caption="" mask="0x03000000" name="FCEIS" />
            <bitfield caption="" mask="0x1C000000" name="FCEIP" />
         </register>
         <register caption="" name="IPC8" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CMP1IS" />
            <bitfield caption="" mask="0x0000001C" name="CMP1IP" />
            <bitfield caption="" mask="0x00000300" name="CMP2IS" />
            <bitfield caption="" mask="0x00001C00" name="CMP2IP" />
            <bitfield caption="" mask="0x03000000" name="SPI1EIS" />
            <bitfield caption="" mask="0x1C000000" name="SPI1EIP" />
         </register>
         <register caption="" name="IPC9" offset="0x1d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="SPI1RXIS" />
            <bitfield caption="" mask="0x0000001C" name="SPI1RXIP" />
            <bitfield caption="" mask="0x00000300" name="SPI1TXIS" />
            <bitfield caption="" mask="0x00001C00" name="SPI1TXIP" />
            <bitfield caption="" mask="0x00030000" name="U1EIS" />
            <bitfield caption="" mask="0x001C0000" name="U1EIP" />
            <bitfield caption="" mask="0x03000000" name="U1RXIS" />
            <bitfield caption="" mask="0x1C000000" name="U1RXIP" />
         </register>
         <register caption="" name="IPC10" offset="0x1e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="U1TXIS" />
            <bitfield caption="" mask="0x0000001C" name="U1TXIP" />
            <bitfield caption="" mask="0x00000300" name="I2C1BIS" />
            <bitfield caption="" mask="0x00001C00" name="I2C1BIP" />
            <bitfield caption="" mask="0x00030000" name="I2C1SIS" />
            <bitfield caption="" mask="0x001C0000" name="I2C1SIP" />
            <bitfield caption="" mask="0x03000000" name="I2C1MIS" />
            <bitfield caption="" mask="0x1C000000" name="I2C1MIP" />
         </register>
         <register caption="" name="IPC11" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CNAIS" />
            <bitfield caption="" mask="0x0000001C" name="CNAIP" />
            <bitfield caption="" mask="0x00000300" name="CNBIS" />
            <bitfield caption="" mask="0x00001C00" name="CNBIP" />
            <bitfield caption="" mask="0x00030000" name="CNCIS" />
            <bitfield caption="" mask="0x001C0000" name="CNCIP" />
            <bitfield caption="" mask="0x03000000" name="CNDIS" />
            <bitfield caption="" mask="0x1C000000" name="CNDIP" />
         </register>
         <register caption="" name="IPC13" offset="0x210" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="SPI2EIS" />
            <bitfield caption="" mask="0x00001C00" name="SPI2EIP" />
            <bitfield caption="" mask="0x00030000" name="SPI2RXIS" />
            <bitfield caption="" mask="0x001C0000" name="SPI2RXIP" />
            <bitfield caption="" mask="0x03000000" name="SPI2TXIS" />
            <bitfield caption="" mask="0x1C000000" name="SPI2TXIP" />
         </register>
         <register caption="" name="IPC14" offset="0x220" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="U2EIS" />
            <bitfield caption="" mask="0x0000001C" name="U2EIP" />
            <bitfield caption="" mask="0x00000300" name="U2RXIS" />
            <bitfield caption="" mask="0x00001C00" name="U2RXIP" />
            <bitfield caption="" mask="0x00030000" name="U2TXIS" />
            <bitfield caption="" mask="0x001C0000" name="U2TXIP" />
            <bitfield caption="" mask="0x03000000" name="I2C2BIS" />
            <bitfield caption="" mask="0x1C000000" name="I2C2BIP" />
         </register>
         <register caption="" name="IPC15" offset="0x230" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="I2C2SIS" />
            <bitfield caption="" mask="0x0000001C" name="I2C2SIP" />
            <bitfield caption="" mask="0x00000300" name="I2C2MIS" />
            <bitfield caption="" mask="0x00001C00" name="I2C2MIP" />
         </register>
         <register caption="" name="IPC17" offset="0x250" rw="RW" size="4">
            <bitfield caption="" mask="0x03000000" name="CTMUIS" />
            <bitfield caption="" mask="0x1C000000" name="CTMUIP" />
         </register>
         <register caption="" name="IPC18" offset="0x260" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="DMA0IS" />
            <bitfield caption="" mask="0x0000001C" name="DMA0IP" />
            <bitfield caption="" mask="0x00000300" name="DMA1IS" />
            <bitfield caption="" mask="0x00001C00" name="DMA1IP" />
            <bitfield caption="" mask="0x00030000" name="DMA2IS" />
            <bitfield caption="" mask="0x001C0000" name="DMA2IP" />
            <bitfield caption="" mask="0x03000000" name="DMA3IS" />
            <bitfield caption="" mask="0x1C000000" name="DMA3IP" />
         </register>
         <register caption="" name="IPC23" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="AD1IS" />
            <bitfield caption="" mask="0x0000001C" name="AD1IP" />
            <bitfield caption="" mask="0x00030000" name="AD1DC1IS" />
            <bitfield caption="" mask="0x001C0000" name="AD1DC1IP" />
            <bitfield caption="" mask="0x03000000" name="AD1DC2IS" />
            <bitfield caption="" mask="0x1C000000" name="AD1DC2IP" />
         </register>
