Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <register caption="" name="IPC24" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="AD1DF1IS" />
            <bitfield caption="" mask="0x0000001C" name="AD1DF1IP" />
            <bitfield caption="" mask="0x00000300" name="AD1DF2IS" />
            <bitfield caption="" mask="0x00001C00" name="AD1DF2IP" />
         </register>
         <register caption="" name="IPC25" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="AD1F1IS" />
            <bitfield caption="" mask="0x0000001C" name="AD1F1IP" />
            <bitfield caption="" mask="0x00000300" name="AD1EOSIS" />
            <bitfield caption="" mask="0x00001C00" name="AD1EOSIP" />
            <bitfield caption="" mask="0x00030000" name="AD1ARIS" />
            <bitfield caption="" mask="0x001C0000" name="AD1ARIP" />
            <bitfield caption="" mask="0x03000000" name="AD1RSIS" />
            <bitfield caption="" mask="0x1C000000" name="AD1RSIP" />
         </register>
         <register caption="" name="IPC26" offset="0x2e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="AD1FCBTIS" />
            <bitfield caption="" mask="0x0000001C" name="AD1FCBTIP" />
            <bitfield caption="" mask="0x00000300" name="AD1G1IS" />
            <bitfield caption="" mask="0x00001C00" name="AD1G1IP" />
            <bitfield caption="" mask="0x00030000" name="AD1D0IS" />
            <bitfield caption="" mask="0x001C0000" name="AD1D0IP" />
            <bitfield caption="" mask="0x03000000" name="AD1D1IS" />
            <bitfield caption="" mask="0x1C000000" name="AD1D1IP" />
         </register>
         <register caption="" name="IPC27" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="AD1D2IS" />
            <bitfield caption="" mask="0x0000001C" name="AD1D2IP" />
            <bitfield caption="" mask="0x00000300" name="AD1D3IS" />
            <bitfield caption="" mask="0x00001C00" name="AD1D3IP" />
            <bitfield caption="" mask="0x00030000" name="AD1D4IS" />
            <bitfield caption="" mask="0x001C0000" name="AD1D4IP" />
            <bitfield caption="" mask="0x03000000" name="AD1D5IS" />
            <bitfield caption="" mask="0x1C000000" name="AD1D5IP" />
         </register>
         <register caption="" name="IPC28" offset="0x300" rw="RW" size="4" />
         <register caption="" name="IPC29" offset="0x310" rw="RW" size="4">
            <bitfield caption="" mask="0x03000000" name="AD1D13IS" />
            <bitfield caption="" mask="0x1C000000" name="AD1D13IP" />
         </register>
         <register caption="" name="IPC30" offset="0x320" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="AD1D15IS" />
            <bitfield caption="" mask="0x00001C00" name="AD1D15IP" />
            <bitfield caption="" mask="0x00030000" name="AD1D16IS" />
            <bitfield caption="" mask="0x001C0000" name="AD1D16IP" />
            <bitfield caption="" mask="0x03000000" name="AD1D17IS" />
            <bitfield caption="" mask="0x1C000000" name="AD1D17IP" />
         </register>
         <register caption="" name="IPC39" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="AD1D50IS" />
            <bitfield caption="" mask="0x0000001C" name="AD1D50IP" />
            <bitfield caption="" mask="0x03000000" name="AD1D53IS" />
            <bitfield caption="" mask="0x1C000000" name="AD1D53IP" />
         </register>
         <register caption="" name="IPC40" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CMP3IS" />
            <bitfield caption="" mask="0x0000001C" name="CMP3IP" />
         </register>
         <register caption="" name="IPC42" offset="0x3e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="QEI1IS" />
            <bitfield caption="" mask="0x00001C00" name="QEI1IP" />
            <bitfield caption="" mask="0x00030000" name="QEI2IS" />
            <bitfield caption="" mask="0x001C0000" name="QEI2IP" />
            <bitfield caption="" mask="0x03000000" name="PWMPEVTIS" />
            <bitfield caption="" mask="0x1C000000" name="PWMPEVTIP" />
         </register>
         <register caption="" name="IPC43" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="PWMSEVTIS" />
            <bitfield caption="" mask="0x0000001C" name="PWMSEVTIP" />
            <bitfield caption="" mask="0x00000300" name="PWM1IS" />
            <bitfield caption="" mask="0x00001C00" name="PWM1IP" />
            <bitfield caption="" mask="0x00030000" name="PWM2IS" />
            <bitfield caption="" mask="0x001C0000" name="PWM2IP" />
            <bitfield caption="" mask="0x03000000" name="PWM3IS" />
            <bitfield caption="" mask="0x1C000000" name="PWM3IP" />
         </register>
         <register caption="" name="IPC44" offset="0x400" rw="R" size="4">
            <bitfield caption="" mask="0x00000003" name="PWM4IS" />
            <bitfield caption="" mask="0x0000001C" name="PWM4IP" />
         </register>
         <register caption="" name="IPC45" offset="0x410" rw="RW" size="4">
            <bitfield caption="" mask="0x00030000" name="DMA4IS" />
            <bitfield caption="" mask="0x001C0000" name="DMA4IP" />
            <bitfield caption="" mask="0x03000000" name="DMA5IS" />
            <bitfield caption="" mask="0x1C000000" name="DMA5IP" />
         </register>
         <register caption="" name="IPC46" offset="0x420" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="DMA6IS" />
            <bitfield caption="" mask="0x0000001C" name="DMA6IP" />
            <bitfield caption="" mask="0x00000300" name="DMA7IS" />
            <bitfield caption="" mask="0x00001C00" name="DMA7IP" />
         </register>
         <register caption="" name="IPC57" offset="0x4d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00030000" name="SBIS" />
            <bitfield caption="" mask="0x001C0000" name="SBIP" />
         </register>
         <register caption="" name="IPC62" offset="0x520" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="CLC1IS" />
            <bitfield caption="" mask="0x00001C00" name="CLC1IP" />
         </register>
         <register caption="" name="IPC63" offset="0x530" rw="RW" size="4">
            <bitfield caption="" mask="0x00030000" name="CPCIS" />
            <bitfield caption="" mask="0x001C0000" name="CPCIP" />
            <bitfield caption="" mask="0x03000000" name="CFDCIS" />
            <bitfield caption="" mask="0x1C000000" name="CFDCIP" />
         </register>
         <register caption="" name="OFF000" offset="0x540" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF001" offset="0x544" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
