Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <register caption="" name="OFF053" offset="0x614" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF054" offset="0x618" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF055" offset="0x61c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF056" offset="0x620" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF057" offset="0x624" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF058" offset="0x628" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF059" offset="0x62c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF060" offset="0x630" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF061" offset="0x634" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF071" offset="0x65c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF072" offset="0x660" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF073" offset="0x664" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF074" offset="0x668" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF075" offset="0x66c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF092" offset="0x6b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF094" offset="0x6b8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF095" offset="0x6bc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF096" offset="0x6c0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF097" offset="0x6c4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF100" offset="0x6d0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF101" offset="0x6d4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF102" offset="0x6d8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF103" offset="0x6dc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF104" offset="0x6e0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF105" offset="0x6e4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF106" offset="0x6e8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF107" offset="0x6ec" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF108" offset="0x6f0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF109" offset="0x6f4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF110" offset="0x6f8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF111" offset="0x6fc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF119" offset="0x71c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF121" offset="0x724" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF122" offset="0x728" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF123" offset="0x72c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF156" offset="0x7b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF159" offset="0x7bc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF169" offset="0x7e4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
