Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="Master Time Base Select bit" name="PWMCON1__MTBS">
         <value caption="Secondary master time base is the clock source for the MCPWM module" name="" value="0x1" />
         <value caption="Primary master time base is the clock source for the MCPWM module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Timer Direction bit" name="PWMCON1__PTDIR">
         <value caption="PWM timer is decrementing" name="" value="0x1" />
         <value caption="PWM timer is incrementing" name="" value="0x0" />
      </value-group>
      <value-group caption="Dead Time Compensation Polarity bit" name="PWMCON1__DTCP">
         <value caption="(If DTCMPx pin is 0)PWMxL is shortened, and PWMxH is lengthened / (If DTCMPx pin is 1)PWMxH is shortened, and PWMxL is lengthened" name="" value="0x1" />
         <value caption="(If DTCMPx pin is 0)PWMxH is shortened, and PWMxL is lengthened / (If DTCMPx pin is 1)PWMxL is shortened, and PWMxH is lengthened" name="" value="0x0" />
      </value-group>
      <value-group caption="Dead Time Control bits" name="PWMCON1__DTC">
         <value caption="Dead Time Compensation mode enabled" name="" value="0x3" />
         <value caption="Dead time function is disabled" name="" value="0x2" />
         <value caption="Negative dead time actively applied for Complementary Output mode(5)" name="" value="0x1" />
         <value caption="Positive dead time actively applied for all output modes" name="" value="0x0" />
      </value-group>
      <value-group caption="Independent Time Base Mode bit" name="PWMCON1__ITB">
         <value caption="PHASEx registers provide time base period for this PWM generator" name="" value="0x1" />
         <value caption="PTPER/STPER register provides timing for this PWM generator based on the MTBS bit" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge/Center-Aligned Mode Enable bits" name="PWMCON1__ECAM">
         <value caption="Asymmetric Center-Aligned mode with simultaneous update (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x3" />
         <value caption="Asymmetric Center-Aligned mode double update (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x2" />
         <value caption="Symmetric Center-Aligned mode (PWM(min) Duty Cycle Resolution = (2/FSYSCLK))" name="" value="0x1" />
         <value caption="Edge-Aligned mode (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" name="PWMCON1__CLTSTAT">
         <value caption="Current-limit interrupt is pending" name="" value="0x1" />
         <value caption="No current-limit interrupt is pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" name="PWMCON1__FLTSTAT">
         <value caption="Fault interrupt is pending" name="" value="0x1" />
         <value caption="No fault interrupt is pending" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM High Phase Interrupt Enable bit" name="PWMCON1__PWMHIEN">
         <value caption="When the PWM Period matches the value in the PWM timer" name="" value="0x1" />
         <value caption="PWM Period event interrupt request is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Low Phase Interrupt Enable bit" name="PWMCON1__PWMLIEN">
         <value caption="When the PWM Timer is equal to 0x4, the PWMLIF flag is 1 and generates an interrupt request" name="" value="0x1" />
         <value caption="PWM Period event interrupt request is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="PWMCON1__TRGIEN">
         <value caption="A primary trigger event generates an interrupt request" name="" value="0x1" />
         <value caption="A primary trigger event interrupts request is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Interrupt Enable bit" name="PWMCON1__CLIEN">
         <value caption="Current-limit interrupt is enabled. If CLIF is 1 an interrupt event will be generated" name="" value="0x1" />
         <value caption="Current-limit interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Enable bit" name="PWMCON1__FLTIEN">
         <value caption="Fault interrupt is enabled. If FLTIF is 1 an interrupt event will be generated" name="" value="0x1" />
         <value caption="Fault interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMH Interrupt Status bit" name="PWMCON1__PWMHIF">
         <value caption="PWM period match interrupt has occurred" name="" value="0x1" />
         <value caption="PWM period match interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="PWML Interrupt Status bit" name="PWMCON1__PWMLIF">
         <value caption="PWM Timer equal to 0x4 interrupt has occurred" name="" value="0x1" />
         <value caption="PWM Interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Interrupt Status bit" name="PWMCON1__TRGIF">
         <value caption="Trigger interrupt is pending" name="" value="0x1" />
         <value caption="Trigger interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Status bit" name="PWMCON1__CLIF">
         <value caption="Current limit has occurred" name="" value="0x1" />
         <value caption="Current limit has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Flag bit" name="PWMCON1__FLTIF">
         <value caption="Fault interrupt has occurred" name="" value="0x1" />
         <value caption="Fault interrupt has not occurred" name="" value="0x0" />
      </value-group>
