Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
      <value-group caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" name="QEI1STAT__PCHEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Status bit" name="QEI1STAT__PCHEQIRQ">
         <value caption="POSxCNT greater than or equal to QEIxICCH" name="" value="0x1" />
         <value caption="POSxCNT less than QEIxICCH" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Input Event Interrupt Enable bit" name="QEI2STAT__IDXIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Index Event Status bit" name="QEI2STAT__IDXIRQ">
         <value caption="Index event has occurred" name="" value="0x1" />
         <value caption="No Index event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Home Input Event Interrupt Enable bit" name="QEI2STAT__HOMIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Home Event Status bit" name="QEI2STAT__HOMIRQ">
         <value caption="Home event has occurred" name="" value="0x1" />
         <value caption="No Home event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Interrupt Enable bit" name="QEI2STAT__VELOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Status bit" name="QEI2STAT__VELOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Interrupt Enable bit" name="QEI2STAT__PCIIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Status bit" name="QEI2STAT__PCIIRQ">
         <value caption="POSxCNT was reinitialized" name="" value="0x1" />
         <value caption="POSxCNT was not reinitialized" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Interrupt Enable bit" name="QEI2STAT__POSOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Status bit" name="QEI2STAT__POSOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" name="QEI2STAT__PCLEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Status bit" name="QEI2STAT__PCLEQIRQ">
         <value caption="POSxCNT less than or equal to QEIxCMPL" name="" value="0x1" />
         <value caption="POSxCNT greater than QEIxCMPL" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" name="QEI2STAT__PCHEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Status bit" name="QEI2STAT__PCHEQIRQ">
         <value caption="POSxCNT greater than or equal to QEIxICCH" name="" value="0x1" />
         <value caption="POSxCNT less than QEIxICCH" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02823" name="RCON" version="2">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="" mask="0x00000020" name="DMTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
            <bitfield caption="Deep Sleep Mode Flag bit" mask="0x00000400" name="DPSLP" />
            <bitfield caption="VBAT Mode Flag bit" mask="0x00010000" name="VBAT" />
            <bitfield caption="VBPOR Mode Flag bit" mask="0x00020000" name="VBPOR" />
            <bitfield caption="Primary/Secondary Configuration Registers Error Flag bit" mask="0x04000000" name="BCFGFAIL" values="RCON__BCFGFAIL" />
            <bitfield caption="Primary Configuration Registers Error Flag bit" mask="0x08000000" name="BCFGERR" values="RCON__BCFGERR" />
            <bitfield caption="" mask="0x40000000" name="PORCORE" />
            <bitfield caption="" mask="0x80000000" name="PORIO" />
         </register>
         <register caption="" name="RSWRST" offset="0x10" rw="W" size="4">
            <bitfield caption="" mask="0x00000001" name="SWRST" />
         </register>
         <register caption="Non-Maskable Interrupt (NMI) Control Register" name="RNMICON" offset="0x20" rw="RW" size="4">
            <bitfield caption="NMI Reset Counter Value bits" mask="0x0000FFFF" name="NMICNT" values="RNMICON__NMICNT" />
            <bitfield caption="Watchdog Timer Time-out in Sleep Mode Flag bit" mask="0x00010000" name="WDTS" values="RNMICON__WDTS" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00020000" name="CF" values="RNMICON__CF" />
            <bitfield caption="" mask="0x00040000" name="HLVD" />
            <bitfield caption="General NMI bit" mask="0x00080000" name="GNMI" values="RNMICON__GNMI" />
            <bitfield caption="Software NMI Trigger" mask="0x00800000" name="SWNMI" values="RNMICON__SWNMI" />
            <bitfield caption="Run Time Watchdog Timer Time-Out Flag bit" mask="0x01000000" name="WDTO" values="RNMICON__WDTO" />
            <bitfield caption="" mask="0x02000000" name="DMTO" />
         </register>
