Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0128MCA028.atdf
         <register caption="" name="PWRCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="Voltage Regulator Stand-by Enable bit" mask="0x00000001" name="VREGS" values="PWRCON__VREGS" />
            <bitfield caption="" mask="0x00000030" name="VREGSLP" />
            <bitfield caption="" mask="0x000000C0" name="VREGRUN" />
         </register>
      </register-group>
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset was not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary/Secondary Configuration Registers Error Flag bit" name="RCON__BCFGFAIL">
         <value caption="An error occurred during a read of the primary and alternate configuration registers" name="" value="0x0" />
         <value caption="No error occurred during a read of the primary and alternate configuration registers" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary Configuration Registers Error Flag bit" name="RCON__BCFGERR">
         <value caption="An error occurred during a read of the primary configuration registers" name="" value="0x0" />
         <value caption="No error occurred during a read of the primary configuration registers" name="" value="0x0" />
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="65535 SYSCLK cycles before a device Reset occurs" name="" value="0xffff" />
         <value caption="2 SYSCLK cycle before a device Reset occurs" name="" value="0x2" />
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1" />
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="" value="0x1" />
         <value caption="WDT time-out has not occurred during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1" />
         <value caption="A general NMI event has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="" value="0x1" />
         <value caption="An NMI will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Run Time Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="WDT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="" value="0x1" />
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01423" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="INT2R" />
         </register>
         <register caption="" name="INT3R" offset="0x8" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="INT3R" />
         </register>
         <register caption="" name="INT4R" offset="0xc" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="INT4R" />
         </register>
